# Wrangle Exercise

### Create Acquire Function

In [8]:
#Create helper function to get the necessary connection url.
def get_connection(db_name):
    '''
    This function uses my info from my env file to
    create a connection url to access the Codeup db.
    '''
    from env import host, user, password
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'

In [9]:
#Create function to retrieve telco_churn data with specific columns
def get_telco_data():
    '''
    This function reads in the Telco Churn data from the Codeup db
    and returns a pandas DataFrame with customer_id, monthly_charges, tenure, total_charges columns
    for customers who have 2-year contracts.
    '''
    
    sql_query = '''
    SELECT customer_id, monthly_charges, tenure, total_charges
    FROM customers
    WHERE contract_type_id LIKE '3'
    '''
    
    return pd.read_sql(sql_query, get_connection('telco_churn'))

In [12]:
df = get_telco_data()

_______________________________

### Prepare Data

In [13]:
df.head()

  customer_id  monthly_charges  tenure total_charges
0  0013-SMEOE           109.70      71       7904.25
1  0014-BMAQU            84.65      63        5377.8
2  0016-QLJIS            90.45      65        5957.9
3  0017-DINOC            45.20      54       2460.55
4  0017-IUDMW           116.80      72       8456.75

In [14]:
#look at data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1695 non-null   object
 1   monthly_charges  1695 non-null   float64
 2   tenure           1695 non-null   int64
 3   total_charges    1695 non-null   object
dtypes: float64(1), int64(1), object(2)
memory usage: 53.1+ KB

In [15]:
df.shape

(1695, 4)

In [17]:
#descriptive statistics of df
df.describe().T

,count,mean,std,min,25%,50%,75%,max
monthly_charges,1695.0,60.770413,34.678865,18.4,24.025,64.35,90.45,118.75
tenure,1695.0,56.735103,18.209363,0.0,48.000,64.00,71.00,72.00

In [18]:
#check for null values
df.isnull().sum()

#this shows that there are none

customer_id        0
monthly_charges    0
tenure             0
total_charges      0
dtype: int64

In [19]:
#again check for nulls
df.isnull().any()

customer_id        False
monthly_charges    False
tenure             False
total_charges      False
dtype: bool

In [20]:
#replace blank spaces and special characters
df = df.replace(r'^\s*$', np.nan, regex=True)

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1695 non-null   object
 1   monthly_charges  1695 non-null   float64
 2   tenure           1695 non-null   int64
 3   total_charges    1685 non-null   object
dtypes: float64(1), int64(1), object(2)
memory usage: 53.1+ KB

In [24]:
#change total_charges to float from object
df.total_charges = df.total_charges.str.replace(' ', '0').astype(float)

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1695 non-null   object
 1   monthly_charges  1695 non-null   float64
 2   tenure           1695 non-null   int64
 3   total_charges    1685 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 53.1+ KB

In [28]:
#find NaN values
df.isna().sum()

#this shows that there are 10 NaN values in total_charges

customer_id         0
monthly_charges     0
tenure              0
total_charges      10
dtype: int64

In [30]:
#drop NaN values (10 out of 1695 isnt significant)
df = df.dropna()

In [32]:
#double check that dropna worked
df.isna().sum()

#there are now no NaN values

customer_id        0
monthly_charges    0
tenure             0
total_charges      0
dtype: int64

In [33]:
#find the new shape of your dataframe
df.shape

(1685, 4)